Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPsi5_bf.h
/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.GO */
#define IFX_PSI5_CH_SCR_GO_OFF (25u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.TPF */
#define IFX_PSI5_CH_SCR_TPF_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.TPF */
#define IFX_PSI5_CH_SCR_TPF_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.TPF */
#define IFX_PSI5_CH_SCR_TPF_OFF (26u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.TSF */
#define IFX_PSI5_CH_SCR_TSF_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.TSF */
#define IFX_PSI5_CH_SCR_TSF_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.TSF */
#define IFX_PSI5_CH_SCR_TSF_OFF (27u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.TOF */
#define IFX_PSI5_CH_SCR_TOF_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.TOF */
#define IFX_PSI5_CH_SCR_TOF_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.TOF */
#define IFX_PSI5_CH_SCR_TOF_OFF (28u)

/** \brief Length for Ifx_PSI5_CH_SCR_Bits.TRQ */
#define IFX_PSI5_CH_SCR_TRQ_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SCR_Bits.TRQ */
#define IFX_PSI5_CH_SCR_TRQ_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SCR_Bits.TRQ */
#define IFX_PSI5_CH_SCR_TRQ_OFF (31u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD0 */
#define IFX_PSI5_CH_SDRL_SD0_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD0 */
#define IFX_PSI5_CH_SDRL_SD0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD0 */
#define IFX_PSI5_CH_SDRL_SD0_OFF (0u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD1 */
#define IFX_PSI5_CH_SDRL_SD1_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD1 */
#define IFX_PSI5_CH_SDRL_SD1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD1 */
#define IFX_PSI5_CH_SDRL_SD1_OFF (1u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD2 */
#define IFX_PSI5_CH_SDRL_SD2_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD2 */
#define IFX_PSI5_CH_SDRL_SD2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD2 */
#define IFX_PSI5_CH_SDRL_SD2_OFF (2u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD3 */
#define IFX_PSI5_CH_SDRL_SD3_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD3 */
#define IFX_PSI5_CH_SDRL_SD3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD3 */
#define IFX_PSI5_CH_SDRL_SD3_OFF (3u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD4 */
#define IFX_PSI5_CH_SDRL_SD4_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD4 */
#define IFX_PSI5_CH_SDRL_SD4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD4 */
#define IFX_PSI5_CH_SDRL_SD4_OFF (4u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD5 */
#define IFX_PSI5_CH_SDRL_SD5_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD5 */
#define IFX_PSI5_CH_SDRL_SD5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD5 */
#define IFX_PSI5_CH_SDRL_SD5_OFF (5u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD6 */
#define IFX_PSI5_CH_SDRL_SD6_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD6 */
#define IFX_PSI5_CH_SDRL_SD6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD6 */
#define IFX_PSI5_CH_SDRL_SD6_OFF (6u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD7 */
#define IFX_PSI5_CH_SDRL_SD7_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD7 */
#define IFX_PSI5_CH_SDRL_SD7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD7 */
#define IFX_PSI5_CH_SDRL_SD7_OFF (7u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD8 */
#define IFX_PSI5_CH_SDRL_SD8_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD8 */
#define IFX_PSI5_CH_SDRL_SD8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD8 */
#define IFX_PSI5_CH_SDRL_SD8_OFF (8u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD9 */
#define IFX_PSI5_CH_SDRL_SD9_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD9 */
#define IFX_PSI5_CH_SDRL_SD9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD9 */
#define IFX_PSI5_CH_SDRL_SD9_OFF (9u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD10 */
#define IFX_PSI5_CH_SDRL_SD10_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD10 */
#define IFX_PSI5_CH_SDRL_SD10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD10 */
#define IFX_PSI5_CH_SDRL_SD10_OFF (10u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD11 */
#define IFX_PSI5_CH_SDRL_SD11_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD11 */
#define IFX_PSI5_CH_SDRL_SD11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD11 */
#define IFX_PSI5_CH_SDRL_SD11_OFF (11u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD12 */
#define IFX_PSI5_CH_SDRL_SD12_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD12 */
#define IFX_PSI5_CH_SDRL_SD12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD12 */
#define IFX_PSI5_CH_SDRL_SD12_OFF (12u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD13 */
#define IFX_PSI5_CH_SDRL_SD13_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD13 */
#define IFX_PSI5_CH_SDRL_SD13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD13 */
#define IFX_PSI5_CH_SDRL_SD13_OFF (13u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD14 */
#define IFX_PSI5_CH_SDRL_SD14_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD14 */
#define IFX_PSI5_CH_SDRL_SD14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD14 */
#define IFX_PSI5_CH_SDRL_SD14_OFF (14u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD15 */
#define IFX_PSI5_CH_SDRL_SD15_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD15 */
#define IFX_PSI5_CH_SDRL_SD15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD15 */
#define IFX_PSI5_CH_SDRL_SD15_OFF (15u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD16 */
#define IFX_PSI5_CH_SDRL_SD16_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD16 */
#define IFX_PSI5_CH_SDRL_SD16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD16 */
#define IFX_PSI5_CH_SDRL_SD16_OFF (16u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD17 */
#define IFX_PSI5_CH_SDRL_SD17_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD17 */
#define IFX_PSI5_CH_SDRL_SD17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD17 */
#define IFX_PSI5_CH_SDRL_SD17_OFF (17u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD18 */
#define IFX_PSI5_CH_SDRL_SD18_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD18 */
#define IFX_PSI5_CH_SDRL_SD18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CH_SDRL_Bits.SD18 */
#define IFX_PSI5_CH_SDRL_SD18_OFF (18u)

/** \brief Length for Ifx_PSI5_CH_SDRL_Bits.SD19 */
#define IFX_PSI5_CH_SDRL_SD19_LEN (1u)

/** \brief Mask for Ifx_PSI5_CH_SDRL_Bits.SD19 */
#define IFX_PSI5_CH_SDRL_SD19_MSK (0x1u)

