Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPsi5_bf.h
/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI3 */
#define IFX_PSI5_CRCIOV_CRCI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI3 */
#define IFX_PSI5_CRCIOV_CRCI3_OFF (3u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI4 */
#define IFX_PSI5_CRCIOV_CRCI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI4 */
#define IFX_PSI5_CRCIOV_CRCI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI4 */
#define IFX_PSI5_CRCIOV_CRCI4_OFF (4u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI5 */
#define IFX_PSI5_CRCIOV_CRCI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI5 */
#define IFX_PSI5_CRCIOV_CRCI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI5 */
#define IFX_PSI5_CRCIOV_CRCI5_OFF (5u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI6 */
#define IFX_PSI5_CRCIOV_CRCI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI6 */
#define IFX_PSI5_CRCIOV_CRCI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI6 */
#define IFX_PSI5_CRCIOV_CRCI6_OFF (6u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI7 */
#define IFX_PSI5_CRCIOV_CRCI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI7 */
#define IFX_PSI5_CRCIOV_CRCI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI7 */
#define IFX_PSI5_CRCIOV_CRCI7_OFF (7u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI8 */
#define IFX_PSI5_CRCIOV_CRCI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI8 */
#define IFX_PSI5_CRCIOV_CRCI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI8 */
#define IFX_PSI5_CRCIOV_CRCI8_OFF (8u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI9 */
#define IFX_PSI5_CRCIOV_CRCI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI9 */
#define IFX_PSI5_CRCIOV_CRCI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI9 */
#define IFX_PSI5_CRCIOV_CRCI9_OFF (9u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI10 */
#define IFX_PSI5_CRCIOV_CRCI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI10 */
#define IFX_PSI5_CRCIOV_CRCI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI10 */
#define IFX_PSI5_CRCIOV_CRCI10_OFF (10u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI11 */
#define IFX_PSI5_CRCIOV_CRCI11_OFF (11u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI12 */
#define IFX_PSI5_CRCIOV_CRCI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI12 */
#define IFX_PSI5_CRCIOV_CRCI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI12 */
#define IFX_PSI5_CRCIOV_CRCI12_OFF (12u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI13 */
#define IFX_PSI5_CRCIOV_CRCI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI13 */
#define IFX_PSI5_CRCIOV_CRCI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI13 */
#define IFX_PSI5_CRCIOV_CRCI13_OFF (13u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI14 */
#define IFX_PSI5_CRCIOV_CRCI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI14 */
#define IFX_PSI5_CRCIOV_CRCI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI14 */
#define IFX_PSI5_CRCIOV_CRCI14_OFF (14u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI15 */
#define IFX_PSI5_CRCIOV_CRCI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI15 */
#define IFX_PSI5_CRCIOV_CRCI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI15 */
#define IFX_PSI5_CRCIOV_CRCI15_OFF (15u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI16 */
#define IFX_PSI5_CRCIOV_CRCI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI16 */
#define IFX_PSI5_CRCIOV_CRCI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI16 */
#define IFX_PSI5_CRCIOV_CRCI16_OFF (16u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI17 */
#define IFX_PSI5_CRCIOV_CRCI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI17 */
#define IFX_PSI5_CRCIOV_CRCI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI17 */
#define IFX_PSI5_CRCIOV_CRCI17_OFF (17u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI18 */
#define IFX_PSI5_CRCIOV_CRCI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI18 */
#define IFX_PSI5_CRCIOV_CRCI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI18 */
#define IFX_PSI5_CRCIOV_CRCI18_OFF (18u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI19 */
#define IFX_PSI5_CRCIOV_CRCI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI19 */
#define IFX_PSI5_CRCIOV_CRCI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI19 */
#define IFX_PSI5_CRCIOV_CRCI19_OFF (19u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI20 */
#define IFX_PSI5_CRCIOV_CRCI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI20 */
#define IFX_PSI5_CRCIOV_CRCI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI20 */
#define IFX_PSI5_CRCIOV_CRCI20_OFF (20u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI21 */
#define IFX_PSI5_CRCIOV_CRCI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI21 */
#define IFX_PSI5_CRCIOV_CRCI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI21 */
#define IFX_PSI5_CRCIOV_CRCI21_OFF (21u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI22 */
#define IFX_PSI5_CRCIOV_CRCI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI22 */
#define IFX_PSI5_CRCIOV_CRCI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI22 */
#define IFX_PSI5_CRCIOV_CRCI22_OFF (22u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI23 */
#define IFX_PSI5_CRCIOV_CRCI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI23 */
#define IFX_PSI5_CRCIOV_CRCI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI23 */
#define IFX_PSI5_CRCIOV_CRCI23_OFF (23u)

/** \brief Length for Ifx_PSI5_CRCIOV_Bits.CRCI24 */
#define IFX_PSI5_CRCIOV_CRCI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCIOV_Bits.CRCI24 */
#define IFX_PSI5_CRCIOV_CRCI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCIOV_Bits.CRCI24 */
#define IFX_PSI5_CRCIOV_CRCI24_OFF (24u)

