Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI3 */
#define IFX_PSI5_NFICLR_NFI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI3 */
#define IFX_PSI5_NFICLR_NFI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI3 */
#define IFX_PSI5_NFICLR_NFI3_OFF (3u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI4 */
#define IFX_PSI5_NFICLR_NFI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI4 */
#define IFX_PSI5_NFICLR_NFI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI4 */
#define IFX_PSI5_NFICLR_NFI4_OFF (4u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI5 */
#define IFX_PSI5_NFICLR_NFI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI5 */
#define IFX_PSI5_NFICLR_NFI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI5 */
#define IFX_PSI5_NFICLR_NFI5_OFF (5u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI6 */
#define IFX_PSI5_NFICLR_NFI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI6 */
#define IFX_PSI5_NFICLR_NFI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI6 */
#define IFX_PSI5_NFICLR_NFI6_OFF (6u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI7 */
#define IFX_PSI5_NFICLR_NFI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI7 */
#define IFX_PSI5_NFICLR_NFI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI7 */
#define IFX_PSI5_NFICLR_NFI7_OFF (7u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI8 */
#define IFX_PSI5_NFICLR_NFI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI8 */
#define IFX_PSI5_NFICLR_NFI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI8 */
#define IFX_PSI5_NFICLR_NFI8_OFF (8u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI9 */
#define IFX_PSI5_NFICLR_NFI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI9 */
#define IFX_PSI5_NFICLR_NFI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI9 */
#define IFX_PSI5_NFICLR_NFI9_OFF (9u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI10 */
#define IFX_PSI5_NFICLR_NFI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI10 */
#define IFX_PSI5_NFICLR_NFI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI10 */
#define IFX_PSI5_NFICLR_NFI10_OFF (10u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI11 */
#define IFX_PSI5_NFICLR_NFI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI11 */
#define IFX_PSI5_NFICLR_NFI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI11 */
#define IFX_PSI5_NFICLR_NFI11_OFF (11u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI12 */
#define IFX_PSI5_NFICLR_NFI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI12 */
#define IFX_PSI5_NFICLR_NFI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI12 */
#define IFX_PSI5_NFICLR_NFI12_OFF (12u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI13 */
#define IFX_PSI5_NFICLR_NFI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI13 */
#define IFX_PSI5_NFICLR_NFI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI13 */
#define IFX_PSI5_NFICLR_NFI13_OFF (13u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI14 */
#define IFX_PSI5_NFICLR_NFI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI14 */
#define IFX_PSI5_NFICLR_NFI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI14 */
#define IFX_PSI5_NFICLR_NFI14_OFF (14u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI15 */
#define IFX_PSI5_NFICLR_NFI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI15 */
#define IFX_PSI5_NFICLR_NFI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI15 */
#define IFX_PSI5_NFICLR_NFI15_OFF (15u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI16 */
#define IFX_PSI5_NFICLR_NFI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI16 */
#define IFX_PSI5_NFICLR_NFI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI16 */
#define IFX_PSI5_NFICLR_NFI16_OFF (16u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI17 */
#define IFX_PSI5_NFICLR_NFI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI17 */
#define IFX_PSI5_NFICLR_NFI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI17 */
#define IFX_PSI5_NFICLR_NFI17_OFF (17u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI18 */
#define IFX_PSI5_NFICLR_NFI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI18 */
#define IFX_PSI5_NFICLR_NFI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI18 */
#define IFX_PSI5_NFICLR_NFI18_OFF (18u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI19 */
#define IFX_PSI5_NFICLR_NFI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI19 */
#define IFX_PSI5_NFICLR_NFI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI19 */
#define IFX_PSI5_NFICLR_NFI19_OFF (19u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI20 */
#define IFX_PSI5_NFICLR_NFI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI20 */
#define IFX_PSI5_NFICLR_NFI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI20 */
#define IFX_PSI5_NFICLR_NFI20_OFF (20u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI21 */
#define IFX_PSI5_NFICLR_NFI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI21 */
#define IFX_PSI5_NFICLR_NFI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI21 */
#define IFX_PSI5_NFICLR_NFI21_OFF (21u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI22 */
#define IFX_PSI5_NFICLR_NFI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI22 */
#define IFX_PSI5_NFICLR_NFI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI22 */
#define IFX_PSI5_NFICLR_NFI22_OFF (22u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI23 */
#define IFX_PSI5_NFICLR_NFI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI23 */
#define IFX_PSI5_NFICLR_NFI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI23 */
#define IFX_PSI5_NFICLR_NFI23_OFF (23u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI24 */
#define IFX_PSI5_NFICLR_NFI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI24 */
#define IFX_PSI5_NFICLR_NFI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI24 */
#define IFX_PSI5_NFICLR_NFI24_OFF (24u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI25 */
#define IFX_PSI5_NFICLR_NFI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_NFICLR_Bits.NFI25 */
#define IFX_PSI5_NFICLR_NFI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NFICLR_Bits.NFI25 */
#define IFX_PSI5_NFICLR_NFI25_OFF (25u)

/** \brief Length for Ifx_PSI5_NFICLR_Bits.NFI26 */
#define IFX_PSI5_NFICLR_NFI26_LEN (1u)

